Revit 2027 API
GeomCombinationSet.Contains Method
Tests for the existence of an GeomCombination within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	GeomCombination item
)
Public Overridable Function Contains (
	item As GeomCombination
) As Boolean
public:
virtual bool Contains(
	GeomCombination^ item
)
abstract Contains :
        item : GeomCombination -> bool
override Contains :
        item : GeomCombination -> bool
Parameters
item GeomCombination
The element to be searched for.
Return Value
Boolean
The Contains method returns True if the GeomCombination is within the set, otherwise False.
See Also
Reference
GeomCombinationSet Class
Autodesk.Revit.DB Namespace